Revit 2027 API
BuiltInFailures.LoadFailures.PointLoadAllZero Property
 Point Load can't have all force components and moment components to be zero.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PointLoadAllZero { get; }
Public Shared ReadOnly Property PointLoadAllZero As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PointLoadAllZero {
	FailureDefinitionId^ get ();
}
static member PointLoadAllZero : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LoadFailures Class
Autodesk.Revit.DB Namespace